amrit817/custom_arm_CM/STM32F7/stm32f769_neo_custom_lib.h
#define  RCC_DCKCFGR1_PLLSAIDIVQ             0x00001F00U
#define  RCC_DCKCFGR1_PLLSAIDIVQ_0           0x00000100U
#define  RCC_DCKCFGR1_PLLSAIDIVQ_1           0x00000200U
#define  RCC_DCKCFGR1_PLLSAIDIVQ_2           0x00000400U
#define  RCC_DCKCFGR1_PLLSAIDIVQ_3           0x00000800U
#define  RCC_DCKCFGR1_PLLSAIDIVQ_4           0x00001000U

#define  RCC_DCKCFGR1_PLLSAIDIVR             0x00030000U
#define  RCC_DCKCFGR1_PLLSAIDIVR_0           0x00010000U
#define  RCC_DCKCFGR1_PLLSAIDIVR_1           0x00020000U

#define  RCC_DCKCFGR1_SAI1SEL                0x00300000U
#define  RCC_DCKCFGR1_SAI1SEL_0              0x00100000U
#define  RCC_DCKCFGR1_SAI1SEL_1              0x00200000U

#define  RCC_DCKCFGR1_SAI2SEL                0x00C00000U
#define  RCC_DCKCFGR1_SAI2SEL_0              0x00400000U
#define  RCC_DCKCFGR1_SAI2SEL_1              0x00800000U

#define  RCC_DCKCFGR1_TIMPRE                 0x01000000U
#define  RCC_DCKCFGR1_DFSDM1SEL              0x02000000U
#define  RCC_DCKCFGR1_ADFSDM1SEL             0x04000000U

/********************  Bit definition for RCC_DCKCFGR2 register  ***************/
#define  RCC_DCKCFGR2_USART1SEL              0x00000003U
#define  RCC_DCKCFGR2_USART1SEL_0            0x00000001U
#define  RCC_DCKCFGR2_USART1SEL_1            0x00000002U
#define  RCC_DCKCFGR2_USART2SEL              0x0000000CU
#define  RCC_DCKCFGR2_USART2SEL_0            0x00000004U
#define  RCC_DCKCFGR2_USART2SEL_1            0x00000008U
#define  RCC_DCKCFGR2_USART3SEL              0x00000030U
#define  RCC_DCKCFGR2_USART3SEL_0            0x00000010U
#define  RCC_DCKCFGR2_USART3SEL_1            0x00000020U
#define  RCC_DCKCFGR2_UART4SEL               0x000000C0U
#define  RCC_DCKCFGR2_UART4SEL_0             0x00000040U
#define  RCC_DCKCFGR2_UART4SEL_1             0x00000080U
#define  RCC_DCKCFGR2_UART5SEL               0x00000300U
#define  RCC_DCKCFGR2_UART5SEL_0             0x00000100U
#define  RCC_DCKCFGR2_UART5SEL_1             0x00000200U
#define  RCC_DCKCFGR2_USART6SEL              0x00000C00U
#define  RCC_DCKCFGR2_USART6SEL_0            0x00000400U
#define  RCC_DCKCFGR2_USART6SEL_1            0x00000800U
#define  RCC_DCKCFGR2_UART7SEL               0x00003000U
#define  RCC_DCKCFGR2_UART7SEL_0             0x00001000U
#define  RCC_DCKCFGR2_UART7SEL_1             0x00002000U
#define  RCC_DCKCFGR2_UART8SEL               0x0000C000U
#define  RCC_DCKCFGR2_UART8SEL_0             0x00004000U
#define  RCC_DCKCFGR2_UART8SEL_1             0x00008000U
#define  RCC_DCKCFGR2_I2C1SEL                0x00030000U
#define  RCC_DCKCFGR2_I2C1SEL_0              0x00010000U
#define  RCC_DCKCFGR2_I2C1SEL_1              0x00020000U
#define  RCC_DCKCFGR2_I2C2SEL                0x000C0000U
#define  RCC_DCKCFGR2_I2C2SEL_0              0x00040000U
#define  RCC_DCKCFGR2_I2C2SEL_1              0x00080000U
#define  RCC_DCKCFGR2_I2C3SEL                0x00300000U
#define  RCC_DCKCFGR2_I2C3SEL_0              0x00100000U
#define  RCC_DCKCFGR2_I2C3SEL_1              0x00200000U
#define  RCC_DCKCFGR2_I2C4SEL                0x00C00000U
#define  RCC_DCKCFGR2_I2C4SEL_0              0x00400000U
#define  RCC_DCKCFGR2_I2C4SEL_1              0x00800000U
#define  RCC_DCKCFGR2_LPTIM1SEL              0x03000000U
#define  RCC_DCKCFGR2_LPTIM1SEL_0            0x01000000U
#define  RCC_DCKCFGR2_LPTIM1SEL_1            0x02000000U
#define  RCC_DCKCFGR2_CECSEL                 0x04000000U
#define  RCC_DCKCFGR2_CK48MSEL               0x08000000U
#define  RCC_DCKCFGR2_SDMMC1SEL              0x10000000U
#define  RCC_DCKCFGR2_SDMMC2SEL              0x20000000U
#define  RCC_DCKCFGR2_DSISEL                 0x40000000U

/**
  * @}
*/
